# GetStairsPath Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsLanding..::..GetStairsPath Method
StairsLanding Class See Also
---
Returns the stairs path curves on the landing. The curves are projected on the stairs base level.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CurveLoop GetStairsPath()
```

Visual Basic
---
```text
Public Function GetStairsPath As CurveLoop
```

Visual C++
---
```text
public:
CurveLoop^ GetStairsPath()
```

# ### Return Value
The stairs path curves of the landing.
# See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace